#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.resource_code: Refreshing state... [id=18qtijfl]
azurerm_resource_group.RG_CPE: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC]
azuread_user.IT-3: Refreshing state... [id=36f629c7-8d8c-403c-8ea9-de644f407176]
azuread_user.IT-1: Refreshing state... [id=d59faf8f-75ef-484f-800c-6e4e6166b876]
azuread_user.IT-2: Refreshing state... [id=7f3c75bc-ac85-4c18-bba8-f97816e33088]
azuread_user.AF-5: Refreshing state... [id=c50138ea-b99a-4725-a232-710545617779]
azuread_user.AF-4: Refreshing state... [id=418532e5-7d94-4cda-9d24-e02da8d6b1e5]
azurerm_public_ip.PublicIP-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/publicIPAddresses/PublicIP-1]
azurerm_network_security_group.example: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/example-security-group]
azurerm_virtual_network.CondidentialServices-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1]
azurerm_storage_account.ConfidentielStorageAccount: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Storage/storageAccounts/confidentiel18qtijfl]
azurerm_virtual_network.System-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1]
azurerm_virtual_network_peering.ConfidentialServicesToSystem: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/virtualNetworkPeerings/ConfidentialServicesToSystem]
azurerm_subnet.System-network-1-subnet-2: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-2]
azurerm_subnet.System-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-1]
azurerm_virtual_network_peering.SystemToConfidentialServices: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/virtualNetworkPeerings/SystemToConfidentialServices]
azurerm_network_interface.JumpStationVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/JumpStationVM1-NIC]
azurerm_storage_share.CondidentialServices-share-1: Refreshing state... [id=https://confidentiel18qtijfl.file.core.windows.net/confidentiel]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_network_interface.ProductionVM1-NIC will be created
  + resource "azurerm_network_interface" "ProductionVM1-NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "francecentral"
      + mac_address                   = (known after apply)
      + name                          = "ProductionVM1-NIC"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "CPE-POC"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "PrimaryIP"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_subnet.CondidentialServices-network-1-subnet-1 will be created
  + resource "azurerm_subnet" "CondidentialServices-network-1-subnet-1" {
      + address_prefixes                               = [
          + "10.0.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "CondidentialServices-network-1-subnet-1"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "CPE-POC"
      + virtual_network_name                           = "CondidentialServices-network-1"
    }

  # azurerm_virtual_machine.JumpStationVM1 will be created
  + resource "azurerm_virtual_machine" "JumpStationVM1" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "francecentral"
      + name                             = "JumpStationVM1"
      + network_interface_ids            = [
          + "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/JumpStationVM1-NIC",
        ]
      + resource_group_name              = "CPE-POC"
      + tags                             = {
          + "environment" = "System"
        }
      + vm_size                          = "Standard_B2s"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_machine.ProductionVM1 will be created
  + resource "azurerm_virtual_machine" "ProductionVM1" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "francecentral"
      + name                             = "ProductionVM1"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "CPE-POC"
      + tags                             = {
          + "environment" = "System"
        }
      + vm_size                          = "Standard_B2s"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "Windows"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_network.CondidentialServices-network-1 will be updated in-place
  ~ resource "azurerm_virtual_network" "CondidentialServices-network-1" {
      ~ address_space           = [
          - "172.16.0.0/16",
          + "10.0.0.0/16",
        ]
        id                      = "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1"
        name                    = "CondidentialServices-network-1"
        tags                    = {
            "environment" = "CondidentialServices"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AxFrancois, Action: `pull_request`, Workflow: `Terraform Plan`*